#include <stdio.h>

 int main() {

    printf("+-----------+-------+-------+-------+\n");                     // แสดงหัวตาราง
    int i = 1, j = 2, k;                                                   // ประกาศตัวแปร int  
    printf("|           |  i = %d|  j = %d|  k = %d|\n", i , j , k);       // แสดงค่าตัวแปรทั้งหมด
    printf("+-----------+-------+-------+-------+\n");                     // แสดงเส้นแบ่งตาราง
    k = i + j;                                                             // คำนวณค่า k เป็นผลรวมของ i และ j
    printf("|k=i+j      |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณของ k = i + j            
    printf("|-----------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    i = i + ( k * j );                                                     // คำนวณค่า i ใหม่โดยใช้ k และ j  
    printf("|i=i+(k*j)  |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณของ i = i + (k * j)
    printf("|-----------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    j = i/2;                                                                // คำนวณค่า j เป็น i หาร 2                                
    printf("|j=i/2      |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณของ j = i / 2      
    printf("|-----------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    k = i % 2;                                                             // คำนวณค่า k เป็นเศษจาก i หาร 2                          
    printf("|k=i%%2      |%7d|%7d|%7d|\n",i, j, k);                        // แสดงผลการคำนวณของ k = i % 2
    printf("|-----------|-------|-------|-------|\n");                     // แสดงเส้นแบ่งตาราง
    i = (j + k) * 3;                                                       // คำนวณค่า i ใหม่โดยใช้ j และ k                          
    printf("|i=(j+k)*3  |%7d|%7d|%7d|\n",i, j, k);                         // แสดงผลการคำนวณของ i = (j + k) * 3
    printf("+-----------+-------+-------+-------+\n");                     // แสดงเส้นล่างสุดของตาราง              


    return 0;                                                           // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานสำเร็จ
 }
