#include <stdio.h>

 int main() {

    printf("+-------------+----------+----------+----------+\n");
    double x = 1.0, y = 2.0, z;
    printf("|             |  x = %.1f|  y = %.1f|  z = %.1f|\n", x , y , z);        // แสดงค่าตัวแปรทั้งหมด
    printf("+-------------+----------+----------+----------+\n");                   // แสดงเส้นแบ่งตาราง
    x = y + 5.0;                                                                    // คำนวณค่า x เป็น y บวก 5.0                              
    printf("|x=y+5.0      |%10.1f|%10.1f|%10.1f|\n",x, y, z);                       // แสดงผลการคำนวณของ x = y + 5.0
    printf("|-------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง
    y = x / 2.0;                                                                    // คำนวณค่า y เป็น x หาร 2.0                              
    printf("|y=x/2.0      |%10.1f|%10.1f|%10.1f|\n",x, y, z);                       // แสดงผลการคำนวณของ y = x / 2.0
    printf("|-------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง
    y = (x * 3.0) + 4.0;                                                            // คำนวณค่า y เป็น x คูณ 3.0 บวก 4.0
    printf("|y=(x*3.0)+4.0|%10.1f|%10.1f|%10.1f|\n",x, y, z);                       // แสดงผลการคำนวณของ y = (x * 3.0) + 4.0
    printf("|-------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง        
    x = -0.5 - y;                                                                   // คำนวณค่า x เป็น -5.0 ลบ y                          
    printf("|x=-5.0-y     |%10.1f|%10.1f|%10.1f|\n",x, y, z);                       // แสดงผลการคำนวณของ x = -5.0 - y          
    printf("|-------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง                  
    z = x + y;                                                                      // คำนวณค่า z เป็น x เท่ากับ y                          
    printf("|z=x+y        |%10.1f|%10.1f|%10.1f|\n",x, y, z);                       // แสดงผลการคำนวณของ z = x + y
    printf("+-------------+----------+----------+----------+\n");                   // แสดงเส้นล่างสุดของตาราง


    return 0;                                                                       // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานสำเร็จ
 }
