#include<stdio.h> // นำเข้าไลบรารีสำหรับการใช้งานฟังก์ชัน printf

int main() {                  // เริ่มต้นโปรแกรมหลัก
    int a=5, b=17;           // กำหนดค่าตัวแปร a และ b เป็นจำนวนเต็ม
    float c=8.5, d=4.0;      // กำหนดค่าตัวแปร c และ d เป็นจำนวนทศนิยม

    printf("All strat a=5,b=17,c=8.5,d=4.0;\n"); //แสดงค่าตัวแปรทั้งหมด
    printf("score d + a = %.1f\n", d + a);      // แสดงผลการบวก d กับ a โดยใช้ %f สำหรับจำนวนทศนิยม d + a = 4.0 + 5
    printf("score a - b = %d\n", a - b);      // แสดงผลการลบ a กับ b โดยใช้ %d สำหรับจำนวนเต็ม a - b = 5 - 17
    printf("score c * d = %.1f\n", c * d);   // แสดงผลการคูณ c กับ d โดยใช้ %f สำหรับจำนวนทศนิยม c * d = 8.5 * 4.0
    printf("score a * c = %.1f\n", a * c);   // แสดงผลการคูณ a กับ c โดยใช้ %f สำหรับจำนวนทศนิยม a * c = 5 * 8.5
    printf("score c / d = %.1f\n", c / d);   // แสดงผลการหาร c กับ d โดยใช้ %f สำหรับจำนวนทศนิยม c / d = 8.5 / 4.0
    printf("score b / c = %.1f\n", b / c);   // แสดงผลการหาร b กับ c โดยใช้ %f สำหรับจำนวนทศนิยม b / c = 17 / 8.5
    printf("score a mod b = %d\n", a % b);   // แสดงผลการหารเอาเศษ a mod b โดยใช้ %d สำหรับจำนวนเต็ม a mod b = 5 % 17
    printf("score c mod a = %.1f\n", c % a); // แสดงผลการหารเอาเศษ c mod a โดยใช้ %f สำหรับจำนวนทศนิยม c mod a = 8.5 % 5
    printf("score c mod d = %.1f\n", c % d); // แสดงผลการหารเอาเศษ c mod d โดยใช้ %f สำหรับจำนวนทศนิยม c mod d = 8.5 % 4.0
    
    return 0;
}
// ในกรณีนี้ run code error : ที่ตำแหน่ง c % a , c % d เนื่องจาก c และ d เป็นจำนวนทศนิยม การใช้ % (modulus) กับจำนวนทศนิยมจะทำให้เกิดข้อผิดพลาด
// การใช้ mod กับจำนวนทศนิยมจะไม่ถูกต้องในภาษา C ควรใช้ mod กับจำนวนเต็มเท่านั้น
